903257958/stm32_oop_driver/ssd1306_spi_hw_dma/driver/oled.c
#define	__oled_config_io_out_pp(port, pin)	{	GPIO_InitTypeDef GPIO_InitStructure; \
												GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT; \
												GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; \
												GPIO_InitStructure.GPIO_Pin = pin ; \
												GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL; \
												GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; \
												GPIO_Init(port, &GPIO_InitStructure); \
											}

#define __oled_io_write(port ,pin, value)	GPIO_WriteBit(port ,pin, (BitAction)value)
											
#define __oled_get_dma_stream(spix)	(	spix == SPI1 ? DMA2_Stream3 : \
										spix == SPI2 ? DMA1_Stream4 : \
										spix == SPI3 ? DMA1_Stream5 : \
										(int)0)

#define	__oled_get_dma_channel(spix)		(	spix == SPI1 ? DMA_Channel_3 : \
												spix == SPI2 ? DMA_Channel_0 : \
												spix == SPI3 ? DMA_Channel_0 : \
												(int)0)
												
#define	__oled_get_dma_flag(spix)		(	spix == SPI1 ? DMA_FLAG_TCIF3 : \
											spix == SPI2 ? DMA_FLAG_TCIF4 : \
											spix == SPI3 ? DMA_FLAG_TCIF5 : \
											(int)0)

#define __oled_gpio_deinit(port)	GPIO_DeInit(port)
											
#endif

/* 最大OLED设备数量 */			
#define MAX_OLED_NUM 4

/**
  * OLED显存数组
  * 所有的显示函数，都只是对此显存数组进行读写
  * 随后调用__oled_update函数或__oled_update_area函数
  * 才会将显存数组的数据发送到OLED硬件，进行显示
  */
uint8_t gOLEDDisplayBuf[MAX_OLED_NUM][8][128];			
						
/* 全局变量用于给注册的OLED设备分配索引 */
static uint8_t gIndex = 0;

/* OLED私有数据结构体 */
typedef struct {
	SPIDev_t oled;		// 硬件SPI设备
	uint8_t index;		// 索引
}OLEDPrivData_t;
				
/* 通信协议 */
static void __oled_res_write(OLEDDev_t *pDev, uint8_t bitValue);
static void __oled_dc_write(OLEDDev_t *pDev, uint8_t bitValue);
static int __oled_write_command(OLEDDev_t *pDev, uint8_t command);
static int __oled_write_data(OLEDDev_t *pDev, uint8_t *data, uint8_t count);
static int __oled_write_data_dma(OLEDDev_t *pDev, uint8_t *data, uint16_t count);

/* 功能函数 */
static int __oled_update(OLEDDev_t *pDev);
static int __oled_update_area(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t width, uint8_t height);
static int __oled_clear(OLEDDev_t *pDev);
static int __oled_clear_area(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t width, uint8_t height);
static int __oled_reverse(OLEDDev_t *pDev);
static int __oled_reverse_area(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t width, uint8_t height);
static int __oled_show_image(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t width, uint8_t height, const uint8_t *image);
static int __oled_show_char(OLEDDev_t *pDev, uint8_t x, uint8_t y, char Char, uint8_t fontSize);
static int __oled_show_string(OLEDDev_t *pDev, uint8_t x, uint8_t y, char *string, uint8_t fontSize);
static int __oled_show_num(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint32_t number, uint8_t length, uint8_t fontSize);
static int __oled_show_signed_num(OLEDDev_t *pDev, uint8_t x, uint8_t y, int32_t number, uint8_t length, uint8_t fontSize);
static int __oled_show_hex_num(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint32_t number, uint8_t length, uint8_t fontSize);
static int __oled_show_bin_num(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint32_t number, uint8_t length, uint8_t fontSize);
static int __oled_show_float_num(OLEDDev_t *pDev, uint8_t x, uint8_t y, double number, uint8_t intLength, uint8_t fraLength, uint8_t fontSize);
static int __oled_show_chinese(OLEDDev_t *pDev, uint8_t x, uint8_t y, char *Chinese);
static int __oled_printf(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t fontSize, char *format, ...);
static int __oled_draw_point(OLEDDev_t *pDev, uint8_t x, uint8_t y);
static uint8_t __oled_get_point(OLEDDev_t *pDev, uint8_t x, uint8_t y);
static int __oled_draw_line(OLEDDev_t *pDev, uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1);
static int __oled_draw_rectangle(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t width, uint8_t height, uint8_t isFilled);
static int __oled_draw_triangle(OLEDDev_t *pDev, uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint8_t x2, uint8_t y2, uint8_t IsFilled);
static int __oled_draw_circle(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t radius, uint8_t IsFilled);
static int __oled_draw_ellipse(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t a, uint8_t b, uint8_t isFilled);
static int __oled_draw_arc(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t radius, int16_t startAngle, int16_t endAngle, uint8_t isFilled);
static int __oled_deinit(OLEDDev_t *pDev);

/******************************************************************************
 * @brief	初始化OLED
 * @param	pDev		:	OLEDDev_t结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
int oled_init(OLEDDev_t *pDev)
{
	if (!pDev)
		return -1;
	
	/* 在初始化前，加入适量延时，待OLED供电稳定 */
	for (uint32_t i = 0; i < 1000; i ++)
		for (uint32_t j = 0; j < 1000; j ++);
	
	/* 保存私有数据 */
	pDev->pPrivData = (OLEDPrivData_t *)malloc(sizeof(OLEDPrivData_t));
	if (!pDev->pPrivData)
		return -1;
	
	OLEDPrivData_t *pPrivData = (OLEDPrivData_t *)pDev->pPrivData;
	
	pPrivData->oled.info.spix = pDev->info.spix;
	pPrivData->oled.info.CSPort = pDev->info.CSPort;
	pPrivData->oled.info.CSPin = pDev->info.CSPin;
	pPrivData->oled.info.prescaler = pDev->info.prescaler;
	pPrivData->oled.info.mode = pDev->info.mode;
	
	pPrivData->index = gIndex++;
	
	/* 配置硬件SPI */
	spi_init(&pPrivData->oled);
	
	/* 配置时钟与GPIO */
	__oled_config_gpio_clock_enable(pDev->info.RESPort);
	__oled_config_gpio_clock_enable(pDev->info.DCPort);
	
	__oled_config_io_out_pp(pDev->info.RESPort, pDev->info.RESPin);
	__oled_config_io_out_pp(pDev->info.DCPort, pDev->info.DCPin);
	
	/* 置引脚默认电平 */
	__oled_res_write(pDev, 1);
	__oled_dc_write(pDev, 1);
	pPrivData->oled.cs_write(&pPrivData->oled, 1);
	
	/* 函数指针赋值 */
	pDev->update = __oled_update;
	pDev->update_area = __oled_update_area;
	pDev->clear = __oled_clear;
	pDev->clear_area = __oled_clear_area;
	pDev->reverse = __oled_reverse;
	pDev->reverse_area = __oled_reverse_area;
	pDev->show_image = __oled_show_image;
	pDev->show_char = __oled_show_char;
	pDev->show_string = __oled_show_string;
	pDev->show_num = __oled_show_num;
	pDev->show_signed_num = __oled_show_signed_num;
	pDev->show_hex_num = __oled_show_hex_num;
	pDev->show_bin_num = __oled_show_bin_num;
	pDev->show_float_num = __oled_show_float_num;
	pDev->show_chinese = __oled_show_chinese;
	pDev->printf = __oled_printf;
	pDev->draw_point = __oled_draw_point;
	pDev->get_point = __oled_get_point;
	pDev->draw_line = __oled_draw_line;
	pDev->draw_rectangle = __oled_draw_rectangle;
	pDev->draw_triangle = __oled_draw_triangle;
	pDev->draw_circle = __oled_draw_circle;
	pDev->draw_ellipse = __oled_draw_ellipse;
	pDev->draw_arc = __oled_draw_arc;
	pDev->deinit = __oled_deinit;
	
	pDev->initFlag = true;
	
	/* 配置OLED */
	__oled_write_command(pDev, 0xAE);	// 设置显示开启/关闭，0xAE关闭，0xAF开启
	
	__oled_write_command(pDev, 0xD5);	// 设置显示时钟分频比/振荡器频率
	__oled_write_command(pDev, 0x80);	// 0x00~0xFF
	
	__oled_write_command(pDev, 0xA8);	// 设置多路复用率
	__oled_write_command(pDev, 0x3F);	// 0x0E~0x3F
	
