903257958/stm32_oop_driver/ssd1306_spi_hw_dma/driver/oled.c
	__oled_write_command(pDev, 0xD3);	// 设置显示偏移
	__oled_write_command(pDev, 0x00);	// 0x00~0x7F
	
	__oled_write_command(pDev, 0x40);	// 设置显示开始行，0x40~0x7F
	
	if(!OLED_DIRECTION)
	{
		__oled_write_command(pDev, 0xA1);	// 设置左右方向，0xA1正常，0xA0左右反置
		__oled_write_command(pDev, 0xC8);	// 设置上下方向，0xC8正常，0xC0上下反置
	}
	else
	{
		__oled_write_command(pDev, 0xA0);	// 设置左右方向，0xA1正常，0xA0左右反置
		__oled_write_command(pDev, 0xC0);	// 设置上下方向，0xC8正常，0xC0上下反置
	}
	
	__oled_write_command(pDev, 0xDA);	// 设置COM引脚硬件配置
	__oled_write_command(pDev, 0x12);
	
	__oled_write_command(pDev, 0x81);	// 设置对比度
	__oled_write_command(pDev, 0xCF);	// 0x00~0xFF
	
	__oled_write_command(pDev, 0xD9);	// 设置预充电周期
	__oled_write_command(pDev, 0xF1);
	
	__oled_write_command(pDev, 0xDB);	// 设置VCOMH取消选择级别
	__oled_write_command(pDev, 0x30);
	
	__oled_write_command(pDev, 0xA4);	// 设置整个显示打开/关闭
	
	__oled_write_command(pDev, 0xA6);	// 设置正常/反色显示，0xA6正常，0xA7反色
	
	__oled_write_command(pDev, 0x8D);	// 设置充电泵
	__oled_write_command(pDev, 0x14);

	__oled_write_command(pDev, 0xAF);	// 开启显示
	
	__oled_clear(pDev);					// 清空显存数组
	__oled_update(pDev);				// 更新显示，清屏，防止初始化后未显示内容时花屏

	return 0;
}

/*通信协议*********************************************************************/

/******************************************************************************
 * @brief	OLED写RES高低电平
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	bitValue	:	要写入RES的电平值，范围：0/1
 * @return	无
 ******************************************************************************/
static void __oled_res_write(OLEDDev_t *pDev, uint8_t bitValue)
{
	__oled_io_write(pDev->info.RESPort, pDev->info.RESPin, bitValue);
}

/******************************************************************************
 * @brief	OLED写DC高低电平
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	bitValue	:	要写入DC的电平值，范围：0/1
 * @return	无
 ******************************************************************************/
static void __oled_dc_write(OLEDDev_t *pDev, uint8_t bitValue)
{
	__oled_io_write(pDev->info.DCPort, pDev->info.DCPin, bitValue);
}

/******************************************************************************
 * @brief	OLED写命令
 * @param	pDev	:	OLEDDev_t结构体指针
 * @param	command	:	要写入的命令值，范围：0x00~0xFF
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_write_command(OLEDDev_t *pDev, uint8_t command)
{
	OLEDPrivData_t *pPrivData = (OLEDPrivData_t *)pDev->pPrivData;
	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	pPrivData->oled.start(&pPrivData->oled);					// 拉低CS，开始通信
	__oled_dc_write(pDev, 0);									// 拉低DC，表示即将发送命令
	pPrivData->oled.swap_byte(&pPrivData->oled, command);		// 写入指定命令
	pPrivData->oled.stop(&pPrivData->oled);						// 拉高CS，结束通信
	
	return 0;
}

/******************************************************************************
 * @brief	OLED写数据
 * @param	pDev	:	OLEDDev_t结构体指针
 * @param	data	:	要写入数据的起始地址
 * @param	count	:	要写入数据的数量
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_write_data(OLEDDev_t *pDev, uint8_t *data, uint8_t count)
{
	OLEDPrivData_t *pPrivData = (OLEDPrivData_t *)pDev->pPrivData;
	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t i;
	
	pPrivData->oled.start(&pPrivData->oled);				// 拉低CS，开始通信
	__oled_dc_write(pDev, 1);								// 拉高DC，表示即将发送数据
	/* 循环count次，进行连续的数据写入 */
	for (i = 0; i < count; i++)
	{
		pPrivData->oled.swap_byte(&pPrivData->oled, data[i]);
	}
	pPrivData->oled.stop(&pPrivData->oled);					// 拉高CS，结束通信
	
	return 0;
}

/******************************************************************************
 * @brief	OLED写数据（DMA）
 * @param	pDev	:	OLEDDev_t结构体指针
 * @param	data	:	要写入数据的起始地址
 * @param	count	:	要写入数据的数量
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_write_data_dma(OLEDDev_t *pDev, uint8_t *data, uint16_t count)
{
	OLEDPrivData_t *pPrivData = (OLEDPrivData_t *)pDev->pPrivData;
	if (!pDev || !pDev->initFlag) return -1;
	
	pPrivData->oled.start(&pPrivData->oled);				// SPI起始
	__oled_dc_write(pDev, 1);								// 拉高DC，表示即将发送数据
	
	__oled_config_dma_clock_enable(pDev->info.spix);		// 开启DMA时钟
	
	#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
	
	DMA_InitTypeDef DMA_InitStructure;
	DMA_DeInit(__oled_get_dma_channel(pDev->info.spix));
	DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&pDev->info.spix->DR;
	DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)data;
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
	DMA_InitStructure.DMA_BufferSize = count;
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
	DMA_InitStructure.DMA_Priority = DMA_Priority_High;
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
	DMA_Init(__oled_get_dma_channel(pDev->info.spix), &DMA_InitStructure);
	
	SPI_I2S_DMACmd(pDev->info.spix, SPI_I2S_DMAReq_Tx, ENABLE);			// 配置SPI为DMA模式
	
	DMA_Cmd(__oled_get_dma_channel(pDev->info.spix), ENABLE);			// 启动DMA传输
	
	while (!DMA_GetFlagStatus(__oled_get_dma_flag(pDev->info.spix)));	// 等待DMA传输完成
	
	DMA_ClearFlag(__oled_get_dma_flag(pDev->info.spix));				// 清除DMA传输完成标志
	
	DMA_Cmd(__oled_get_dma_channel(pDev->info.spix), DISABLE);			// 禁用DMA传输
	
	#elif defined(STM32F40_41xxx)
	
	DMA_InitTypeDef DMA_InitStructure;
	DMA_DeInit(__oled_get_dma_stream(pDev->info.spix));
	DMA_InitStructure.DMA_Channel = __oled_get_dma_channel(pDev->info.spix);
	DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&pDev->info.spix->DR;
	DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)data;
	DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
	DMA_InitStructure.DMA_BufferSize = count;
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
	DMA_InitStructure.DMA_Priority = DMA_Priority_High;
	DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;
	DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;
	DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
	DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
	DMA_Init(__oled_get_dma_stream(pDev->info.spix), &DMA_InitStructure);
	
	SPI_I2S_DMACmd(pDev->info.spix, SPI_I2S_DMAReq_Tx, ENABLE);				// 配置SPI为DMA模式
	
	DMA_Cmd(__oled_get_dma_stream(pDev->info.spix), ENABLE);				// 启动DMA传输
	
	while (!DMA_GetFlagStatus(	__oled_get_dma_stream(pDev->info.spix), 
								__oled_get_dma_flag(pDev->info.spix))	);	// 等待DMA传输完成
	
	DMA_ClearFlag(	__oled_get_dma_stream(pDev->info.spix), 
					__oled_get_dma_flag(pDev->info.spix)	);				// 清除DMA传输完成标志
	
	DMA_Cmd(__oled_get_dma_stream(pDev->info.spix), DISABLE);				// 禁用DMA传输
	
	#endif
	
	pPrivData->oled.stop(&pPrivData->oled);	// SPI终止
	
