903257958/stm32_oop_driver/ssd1306_spi_hw_dma/driver/oled.c
	return 0;
}

/**********************************************************************通信协议*/

/*硬件配置**********************************************************************/

/******************************************************************************
 * @brief	OLED设置显示光标位置，OLED默认的y轴，只能8个Bit为一组写入，即1页等于8个y轴坐标
 * @param	pDev	:	OLEDDev_t结构体指针
 * @param	page	:	指定光标所在的页，范围：0~7
 * @param	x		:	指定光标所在的x轴坐标，范围：0~127
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int OLED_SetCursor(OLEDDev_t *pDev, uint8_t page, uint8_t x)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	/*如果使用此程序驱动1.3寸的OLED显示屏，则需要解除此注释*/
	/*因为1.3寸的OLED驱动芯片（SH1106）有132列*/
	/*屏幕的起始列接在了第2列，而不是第0列*/
	/*所以需要将x加2，才能正常显示*/
//	x += 2;
	
	/* 通过指令设置页地址和列地址 */
	__oled_write_command(pDev, 0xB0 | page);				// 设置页位置
	__oled_write_command(pDev, 0x10 | ((x & 0xF0) >> 4));	// 设置x位置高4位
	__oled_write_command(pDev, 0x00 | (x & 0x0F));			// 设置x位置低4位
	
	return 0;
}

/**********************************************************************硬件配置*/

/*工具函数**********************************************************************/

/******************************************************************************
 * @brief	次方函数
 * @param	x	:	底数
 * @param	y	:	指数
 * @return	x^y
 ******************************************************************************/
uint32_t OLED_Pow(uint32_t x, uint32_t y)
{
	uint32_t result = 1;	// 结果默认为1
	while (y --)			// 累乘y次
	{
		result *= x;		// 每次把x累乘到结果上
	}
	return result;
}

/******************************************************************************
 * @brief	判断指定点是否在指定多边形内部
 * @param	nvert		:	多边形的顶点数
 * @param	vertx verty	:	包含多边形顶点的x和y坐标的数组
 * @param	testx testy	:	测试点的x和y坐标
 * @return	指定点是否在指定多边形内部，1：在内部，0：不在内部
 ******************************************************************************/
uint8_t OLED_pnpoly(uint8_t nvert, int16_t *vertx, int16_t *verty, int16_t testx, int16_t testy)
{
	int16_t i, j, c = 0;
	
	/*此算法由W. Randolph Franklin提出*/
	/*参考链接：https://wrfranklin.org/Research/Short_Notes/pnpoly.html*/
	for (i = 0, j = nvert - 1; i < nvert; j = i++)
	{
		if (((verty[i] > testy) != (verty[j] > testy)) &&
			(testx < (vertx[j] - vertx[i]) * (testy - verty[i]) / (verty[j] - verty[i]) + vertx[i]))
		{
			c = !c;
		}
	}
	return c;
}

/******************************************************************************
 * @brief	判断指定点是否在指定角度内部
 * @param	x y					:	指定点的坐标
 * @param	StartAngle EndAngle	:	起始角度和终止角度，范围：-180~180
			水平向右为0度，水平向左为180度或-180度，下方为正数，上方为负数，顺时针旋转
 * @param	testx testy	:  测试点的x和y坐标
 * @return	指定点是否在指定角度内部，1：在内部，0：不在内部
 ******************************************************************************/
uint8_t OLED_IsInAngle(int16_t x, int16_t y, int16_t startAngle, int16_t endAngle)
{
	int16_t PointAngle;
	PointAngle = atan2(y, x) / 3.14 * 180;	// 计算指定点的弧度，并转换为角度表示
	if (startAngle < endAngle)	// 起始角度小于终止角度的情况
	{
		/* 如果指定角度在起始终止角度之间，则判定指定点在指定角度 */
		if (PointAngle >= startAngle && PointAngle <= endAngle)
		{
			return 1;
		}
	}
	else			// 起始角度大于于终止角度的情况
	{
		/* 如果指定角度大于起始角度或者小于终止角度，则判定指定点在指定角度 */
		if (PointAngle >= startAngle || PointAngle <= endAngle)
		{
			return 1;
		}
	}
	return 0;		// 不满足以上条件，则判断判定指定点不在指定角度
}

/**********************************************************************工具函数*/

/*功能函数**********************************************************************/

/******************************************************************************
 * @brief	将OLED显存数组更新到OLED屏幕
 * @param	pDev	:	OLEDDev_t结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_update(OLEDDev_t *pDev)
{
    OLEDPrivData_t *pPrivData = (OLEDPrivData_t *)pDev->pPrivData;
    if (!pDev || !pDev->initFlag) return -1;

    uint8_t j;
    /* 遍历每一页 */
    for (j = 0; j < 8; j++) {
        /* 设置光标位置为每一页的第一列 */
        OLED_SetCursor(pDev, j, 0);

        /* 使用DMA传输数据 */
        __oled_write_data_dma(pDev, gOLEDDisplayBuf[pPrivData->index][j], 128);
		//__oled_write_data(pDev, gOLEDDisplayBuf[pPrivData->index][j], 128);
    }
    return 0;
}
/******************************************************************************
 * @brief	将OLED显存数组部分更新到OLED屏幕，此函数会至少更新参数指定的区域
			如果更新区域y轴只包含部分页，则同一页的剩余部分会跟随一起更新
 * @param	pDev	:	OLEDDev_t结构体指针
 * @param	x		:	指定区域左上角的横坐标，范围：0~127
 * @param	y		:	指定区域左上角的纵坐标，范围：0~63
 * @param	width	:	指定区域的宽度，范围：0~128
 * @param	height	:	指定区域的高度，范围：0~64
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_update_area(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t width, uint8_t height)
{
	OLEDPrivData_t *pPrivData = (OLEDPrivData_t *)pDev->pPrivData;
	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t j;
	
	/* 参数检查，保证指定区域不会超出屏幕范围 */
	if (x > 127) {return -1;}
	if (y > 63) {return -1;}
	if (x + width > 128) {width = 128 - x;}
	if (y + height > 64) {height = 64 - y;}
	
	/* 遍历指定区域涉及的相关页 */
	/* (y + height - 1) / 8 + 1的目的是(y + height) / 8并向上取整 */
	for (j = y / 8; j < (y + height - 1) / 8 + 1; j ++)
	{
		/* 设置光标位置为相关页的指定列 */
		OLED_SetCursor(pDev, j, x);
		/* 连续写入width个数据，将显存数组的数据写入到OLED硬件 */
		__oled_write_data(pDev, &gOLEDDisplayBuf[pPrivData->index][j][x], width);
	}
	
	return 0;
}

/******************************************************************************
 * @brief	将OLED显存数组全部清零
 * @param	pDev	:	OLEDDev_t结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_clear(OLEDDev_t *pDev)
{
	OLEDPrivData_t *pPrivData = (OLEDPrivData_t *)pDev->pPrivData;
	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t i, j;
	for (j = 0; j < 8; j ++)				// 遍历8页
	{
		for (i = 0; i < 128; i ++)			// 遍历128列
		{
			gOLEDDisplayBuf[pPrivData->index][j][i] = 0x00;	// 将显存数组数据全部清零
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	将OLED显存数组部分清零
 * @param	pDev	:	OLEDDev_t结构体指针
 * @param	x		:	指定区域左上角的横坐标，范围：0~127
 * @param	y		:	指定区域左上角的纵坐标，范围：0~63
 * @param	width	:	指定区域的宽度，范围：0~128
 * @param	height	:	指定区域的高度，范围：0~64
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_clear_area(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t width, uint8_t height)
{
	OLEDPrivData_t *pPrivData = (OLEDPrivData_t *)pDev->pPrivData;
	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t i, j;
	
