903257958/stm32_oop_driver/ssd1306_spi_hw_dma/driver/oled.c
	/* 参数检查，保证指定区域不会超出屏幕范围 */
	if (x > 127) {return -1;}
	if (y > 63) {return -1;}
	if (x + width > 128) {width = 128 - x;}
	if (y + height > 64) {height = 64 - y;}
	
	for (j = y; j < y + height; j ++)		// 遍历指定页
	{
		for (i = x; i < x + width; i ++)	// 遍历指定列
		{
			gOLEDDisplayBuf[pPrivData->index][j / 8][i] &= ~(0x01 << (j % 8));	// 将显存数组指定数据清零
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	将OLED显存数组全部取反
 * @param	pDev	:	OLEDDev_t结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_reverse(OLEDDev_t *pDev)
{
	OLEDPrivData_t *pPrivData = (OLEDPrivData_t *)pDev->pPrivData;
	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t i, j;
	for (j = 0; j < 8; j ++)				// 遍历8页
	{
		for (i = 0; i < 128; i ++)			// 遍历128列
		{
			gOLEDDisplayBuf[pPrivData->index][j][i] ^= 0xFF;	// 将显存数组数据全部取反
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	将OLED显存数组部分取反
 * @param	pDev	:	OLEDDev_t结构体指针
 * @param	x		:	指定区域左上角的横坐标，范围：0~127
 * @param	y		:	指定区域左上角的纵坐标，范围：0~63
 * @param	width	:	指定区域的宽度，范围：0~128
 * @param	height	:	指定区域的高度，范围：0~64
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_reverse_area(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t width, uint8_t height)
{
	OLEDPrivData_t *pPrivData = (OLEDPrivData_t *)pDev->pPrivData;
	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t i, j;
	
	/* 参数检查，保证指定区域不会超出屏幕范围 */
	if (x > 127) {return -1;}
	if (y > 63) {return -1;}
	if (x + width > 128) {width = 128 - x;}
	if (y + height > 64) {height = 64 - y;}
	
	for (j = y; j < y + height; j ++)		// 遍历指定页
	{
		for (i = x; i < x + width; i ++)	// 遍历指定列
		{
			gOLEDDisplayBuf[pPrivData->index][j / 8][i] ^= 0x01 << (j % 8);	// 将显存数组指定数据取反
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示图像
 * @param	pDev	:	OLEDDev_t结构体指针
 * @param	x		:	指定图像左上角的横坐标，范围：0~127
 * @param	y		:	指定图像左上角的纵坐标，范围：0~63
 * @param	width	:	指定图像的宽度，范围：0~128
 * @param	height	:	指定图像的高度，范围：0~64
 * @param	image	:	指定要显示的图像
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_image(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t width, uint8_t height, const uint8_t *image)
{
	OLEDPrivData_t *pPrivData = (OLEDPrivData_t *)pDev->pPrivData;
	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t i, j;
	
	/* 参数检查，保证指定图像不会超出屏幕范围 */
	if (x > 127) {return -1;}
	if (y > 63) {return -1;}
	
	/* 将图像所在区域清空 */
	__oled_clear_area(pDev, x, y, width, height);
	
	/* 遍历指定图像涉及的相关页*/
	/* (height - 1) / 8 + 1的目的是height / 8并向上取整 */
	for (j = 0; j < (height - 1) / 8 + 1; j ++)
	{
		/* 遍历指定图像涉及的相关列 */
		for (i = 0; i < width; i ++)
		{
			/* 超出边界，则跳过显示 */
			if (x + i > 127) {break;}
			if (y / 8 + j > 7) {return -1;}
			
			/* 显示图像在当前页的内容 */
			gOLEDDisplayBuf[pPrivData->index][y / 8 + j][x + i] |= image[j * width + i] << (y % 8);
			
			/* 超出边界，则跳过显示 */
			/* 使用continue的目的是，下一页超出边界时，上一页的后续内容还需要继续显示 */
			if (y / 8 + j + 1 > 7) {continue;}
			
			/* 显示图像在下一页的内容 */
			gOLEDDisplayBuf[pPrivData->index][y / 8 + j + 1][x + i] |= image[j * width + i] >> (8 - y % 8);
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示一个字符
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	x			:	指定字符左上角的横坐标，范围：0~127
 * @param	y			:	指定区域左上角的纵坐标，范围：0~63
 * @param	character	:	指定要显示的字符，范围：ASCII码可见字符
 * @param	fontSize	:	指定字体大小
			范围	OLED_8X16	宽8像素，高16像素
					OLED_6X8	宽6像素，高8像素
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_char(OLEDDev_t *pDev, uint8_t x, uint8_t y, char Char, uint8_t fontSize)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	if (fontSize == OLED_8X16)		// 字体为宽8像素，高16像素
	{
		/* 将ASCII字模库OLED_F8x16的指定数据以8*16的图像格式显示 */
		__oled_show_image(pDev, x, y, 8, 16, OLED_F8x16[Char - ' ']);
	}
	else if(fontSize == OLED_6X8)	//字体为宽6像素，高8像素
	{
		/* 将ASCII字模库OLED_F6x8的指定数据以6*8的图像格式显示 */
		__oled_show_image(pDev, x, y, 6, 8, OLED_F6x8[Char - ' ']);
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示字符串
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	x			:	指定字符串左上角的横坐标，范围：0~127
 * @param	y			:	指定字符串左上角的纵坐标，范围：0~63
 * @param	string		:	指定要显示的字符串，范围：ASCII码可见字符组成的字符串
 * @param	fontSize	:	指定字体大小
			范围	OLED_8X16	宽8像素，高16像素
					OLED_6X8	宽6像素，高8像素
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_string(OLEDDev_t *pDev, uint8_t x, uint8_t y, char *string, uint8_t fontSize)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t i;
	for (i = 0; string[i] != '\0'; i++)		//遍历字符串的每个字符
	{
		/* 调用__oled_show_char函数，依次显示每个字符 */
		__oled_show_char(pDev, x + i * fontSize, y, string[i], fontSize);
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示数字（十进制，正整数）
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	x			:	指定数字左上角的横坐标，范围：0~127
 * @param	y			:	指定数字左上角的纵坐标，范围：0~63
 * @param	number		:	指定要显示的数字，范围：0~4294967295
 * @param	length		:	指定数字的长度，范围：0~10
 * @param	fontSize	:	指定字体大小
			范围	OLED_8X16	宽8像素，高16像素
					OLED_6X8	宽6像素，高8像素
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_num(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint32_t number, uint8_t length, uint8_t fontSize)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t i;
	for (i = 0; i < length; i++)		// 遍历数字的每一位							
	{
		/* 调用__oled_show_char函数，依次显示每个数字 */
		/* Number / OLED_Pow(10, length - i - 1) % 10 可以十进制提取数字的每一位 */
		/* + '0' 可将数字转换为字符格式 */
		__oled_show_char(pDev, x + i * fontSize, y, number / OLED_Pow(10, length - i - 1) % 10 + '0', fontSize);
	}
	
