903257958/stm32_oop_driver/ssd1306_spi_hw_dma/driver/oled.c
	return 0;
}

/******************************************************************************
 * @brief	OLED显示有符号数字（十进制，整数）
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	x			:	指定数字左上角的横坐标，范围：0~127
 * @param	y			:	指定数字左上角的纵坐标，范围：0~63
 * @param	number		:	指定要显示的数字，范围：-2147483648~2147483647
 * @param	length		:	指定数字的长度，范围：0~10
 * @param	fontSize	:	指定字体大小
			范围	OLED_8X16	宽8像素，高16像素
					OLED_6X8	宽6像素，高8像素
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_signed_num(OLEDDev_t *pDev, uint8_t x, uint8_t y, int32_t number, uint8_t length, uint8_t fontSize)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t i;
	uint32_t Number1;
	
	if (number >= 0)								// 数字大于等于0
	{
		__oled_show_char(pDev, x, y, '+', fontSize);// 显示+号
		Number1 = number;							// Number1直接等于Number
	}
	else											// 数字小于0
	{
		__oled_show_char(pDev, x, y, '-', fontSize);// 显示-号
		Number1 = -number;							// Number1等于Number取负
	}
	
	for (i = 0; i < length; i++)					// 遍历数字的每一位								
	{
		/* 调用__oled_show_char函数，依次显示每个数字 */
		/* Number1 / OLED_Pow(10, length - i - 1) % 10 可以十进制提取数字的每一位 */
		/* + '0' 可将数字转换为字符格式 */
		__oled_show_char(pDev, x + (i + 1) * fontSize, y, Number1 / OLED_Pow(10, length - i - 1) % 10 + '0', fontSize);
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示十六进制数字（十六进制，正整数）
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	x			:	指定数字左上角的横坐标，范围：0~127
 * @param	y			:	指定数字左上角的纵坐标，范围：0~63
 * @param	number		:	指定要显示的数字，范围：0x00000000~0xFFFFFFFF
 * @param	length		:	指定数字的长度，范围：0~8
 * @param	fontSize	:	指定字体大小
			范围	OLED_8X16	宽8像素，高16像素
					OLED_6X8	宽6像素，高8像素
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_hex_num(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint32_t number, uint8_t length, uint8_t fontSize)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t i, SingleNumber;
	for (i = 0; i < length; i++)		// 遍历数字的每一位
	{
		/* 以十六进制提取数字的每一位 */
		SingleNumber = number / OLED_Pow(16, length - i - 1) % 16;
		
		if (SingleNumber < 10)			// 单个数字小于10
		{
			/* 调用__oled_show_char函数，显示此数字 */
			/* + '0' 可将数字转换为字符格式 */
			__oled_show_char(pDev, x + i * fontSize, y, SingleNumber + '0', fontSize);
		}
		else							// 单个数字大于10
		{
			/* 调用__oled_show_char函数，显示此数字 */
			/* + 'A' 可将数字转换为从A开始的十六进制字符 */
			__oled_show_char(pDev, x + i * fontSize, y, SingleNumber - 10 + 'A', fontSize);
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示二进制数字（二进制，正整数）
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	x			:	指定数字左上角的横坐标，范围：0~127
 * @param	y			:	指定数字左上角的纵坐标，范围：0~63
 * @param	number		:	指定要显示的数字，范围：0x00000000~0xFFFFFFFF
 * @param	length		:	指定数字的长度，范围：0~16
 * @param	fontSize	:	指定字体大小
			范围	OLED_8X16	宽8像素，高16像素
					OLED_6X8	宽6像素，高8像素
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_bin_num(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint32_t number, uint8_t length, uint8_t fontSize)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t i;
	for (i = 0; i < length; i++)		// 遍历数字的每一位	
	{
		/* 调用__oled_show_char函数，依次显示每个数字 */
		/* Number / OLED_Pow(2, length - i - 1) % 2 可以二进制提取数字的每一位 */
		/* + '0' 可将数字转换为字符格式 */
		__oled_show_char(pDev, x + i * fontSize, y, number / OLED_Pow(2, length - i - 1) % 2 + '0', fontSize);
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示二进制数字（二进制，正整数）
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	x			:	指定数字左上角的横坐标，范围：0~127
 * @param	y			:	指定数字左上角的纵坐标，范围：0~63
 * @param	number		:	指定要显示的数字，范围：-4294967295.0~4294967295.0
 * @param	intLength	:	指定数字的整数位长度，范围：0~10
 * @param	fraLength	:	指定数字的小数位长度，范围：0~9，小数进行四舍五入显示
 * @param	fontSize	:	指定字体大小
			范围	OLED_8X16	宽8像素，高16像素
					OLED_6X8	宽6像素，高8像素
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_float_num(OLEDDev_t *pDev, uint8_t x, uint8_t y, double number, uint8_t intLength, uint8_t fraLength, uint8_t fontSize)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint32_t PowNum, IntNum, FraNum;
	
	if (number >= 0)						// 数字大于等于0
	{
		__oled_show_char(pDev, x, y, '+', fontSize);	// 显示+号
	}
	else									// 数字小于0
	{
		__oled_show_char(pDev, x, y, '-', fontSize);	// 显示-号
		number = -number;					// Number取负
	}
	
	/* 提取整数部分和小数部分 */
	IntNum = number;						// 直接赋值给整型变量，提取整数
	number -= IntNum;						// 将Number的整数减掉，防止之后将小数乘到整数时因数过大造成错误
	PowNum = OLED_Pow(10, fraLength);		// 根据指定小数的位数，确定乘数
	FraNum = round(number * PowNum);		// 将小数乘到整数，同时四舍五入，避免显示误差
	IntNum += FraNum / PowNum;				// 若四舍五入造成了进位，则需要再加给整数
	
	/* 显示整数部分 */
	__oled_show_num(pDev, x + fontSize, y, IntNum, intLength, fontSize);
	
	/* 显示小数点 */
	__oled_show_char(pDev, x + (intLength + 1) * fontSize, y, '.', fontSize);
	
	/* 显示小数部分 */
	__oled_show_num(pDev, x + (intLength + 2) * fontSize, y, FraNum, fraLength, fontSize);
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示汉字串
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	x			:	指定汉字串左上角的横坐标，范围：0~127
 * @param	y			:	指定汉字串左上角的纵坐标，范围：0~63
 * @param	Chinese		:	指定要显示的汉字串，范围：必须全部为汉字或者全角字符，不要加入任何半角字符
							显示的汉字需要在OLED_Data.c里的OLED_CF16x16数组定义
							未找到指定汉字时，会显示默认图形（一个方框，内部一个问号）
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_chinese(OLEDDev_t *pDev, uint8_t x, uint8_t y, char *Chinese)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t pChinese = 0;
	uint8_t pIndex;
	uint8_t i;
	char SingleChinese[OLED_CHN_CHAR_WIDTH + 1] = {0};
	
	for (i = 0; Chinese[i] != '\0'; i ++)		// 遍历汉字串
	{
		SingleChinese[pChinese] = Chinese[i];	// 提取汉字串数据到单个汉字数组
		pChinese ++;							// 计次自增
		
		/* 当提取次数到达OLED_CHN_CHAR_WIDTH时，即代表提取到了一个完整的汉字 */
		if (pChinese >= OLED_CHN_CHAR_WIDTH)
		{
			pChinese = 0;		// 计次归零
			
			/* 遍历整个汉字字模库，寻找匹配的汉字 */
			/* 如果找到最后一个汉字（定义为空字符串），则表示汉字未在字模库定义，停止寻找 */
			for (pIndex = 0; strcmp(OLED_CF16x16[pIndex].Index, "") != 0; pIndex ++)
			{
				/* 找到匹配的汉字 */
				if (strcmp(OLED_CF16x16[pIndex].Index, SingleChinese) == 0)
				{
					break;		// 跳出循环，此时pIndex的值为指定汉字的索引
				}
			}
			
