903257958/stm32_oop_driver/ssd1306_spi_hw_dma/driver/oled.c
			/* 将汉字字模库OLED_CF16x16的指定数据以16*16的图像格式显示 */
			__oled_show_image(pDev, x + ((i + 1) / OLED_CHN_CHAR_WIDTH - 1) * 16, y, 16, 16, OLED_CF16x16[pIndex].Data);
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED使用printf函数打印格式化字符串
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	x			:	指定格式化字符串左上角的横坐标，范围：0~127
 * @param	y			:	指定格式化字符串左上角的纵坐标，范围：0~63
 * @param	fontSize	:	指定字体大小
			范围	OLED_8X16	宽8像素，高16像素
					OLED_6X8	宽6像素，高8像素
 * @param	format		:	指定要显示的格式化字符串，范围：ASCII码可见字符组成的字符串
 * @param	...			:	格式化字符串参数列表
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_printf(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t fontSize, char *format, ...)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	char string[30];						// 定义字符数组
	va_list arg;							// 定义可变参数列表数据类型的变量arg
	va_start(arg, format);					// 从format开始，接收参数列表到arg变量
	vsprintf(string, format, arg);			// 使用vsprintf打印格式化字符串和参数列表到字符数组中
	va_end(arg);							// 结束变量arg
	__oled_show_string(pDev, x, y, string, fontSize);// OLED显示字符数组（字符串）
	
	return 0;
}

/******************************************************************************
 * @brief	OLED在指定位置画一个点
 * @param	pDev	:	OLEDDev_t结构体指针
 * @param	x		:	指定点的横坐标，范围：0~127
 * @param	y		:	指定点的纵坐标，范围：0~63
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_draw_point(OLEDDev_t *pDev, uint8_t x, uint8_t y)
{
	OLEDPrivData_t *pPrivData = (OLEDPrivData_t *)pDev->pPrivData;
	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	/* 参数检查，保证指定位置不会超出屏幕范围 */
	if (x > 127) {return -1;}
	if (y > 63) {return -1;}
	
	/* 将显存数组指定位置的一个Bit数据置1 */
	gOLEDDisplayBuf[pPrivData->index][y / 8][x] |= 0x01 << (y % 8);
	
	return 0;
}

/******************************************************************************
 * @brief	OLED获取指定位置点的值
 * @param	pDev	:	OLEDDev_t结构体指针
 * @param	x		:	指定点的横坐标，范围：0~127
 * @param	y		:	指定点的纵坐标，范围：0~63
 * @return	指定位置点是否处于点亮状态，1：点亮，0：熄灭
 ******************************************************************************/
static uint8_t __oled_get_point(OLEDDev_t *pDev, uint8_t x, uint8_t y)
{
	OLEDPrivData_t *pPrivData = (OLEDPrivData_t *)pDev->pPrivData;
	
	/* 参数检查，保证指定位置不会超出屏幕范围 */
	if (x > 127) {return 0;}
	if (y > 63) {return 0;}
	
	/* 判断指定位置的数据 */
	if (gOLEDDisplayBuf[pPrivData->index][y / 8][x] & 0x01 << (y % 8))
	{
		return 1;	// 为1，返回1
	}
	return 0;		// 否则，返回0
}

/******************************************************************************
 * @brief	OLED画线
 * @param	pDev	:	OLEDDev_t结构体指针
 * @param	x0		:	指定一个端点的横坐标，范围：0~127
 * @param	y0		:	指定一个端点的纵坐标，范围：0~63
 * @param	x1		:	指定另一个端点的横坐标，范围：0~127
 * @param	y1		:	指定另一个端点的纵坐标，范围：0~63
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_draw_line(OLEDDev_t *pDev, uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	int16_t x, y, dx, dy, d, incrE, incrNE, temp;
	uint8_t yflag = 0, xyflag = 0;
	
	if (y0 == y1)		// 横线单独处理
	{
		/* 0号点X坐标大于1号点X坐标，则交换两点X坐标 */
		if (x0 > x1) {temp = x0; x0 = x1; x1 = temp;}
		
		/* 遍历X坐标 */
		for (x = x0; x <= x1; x ++)
		{
			__oled_draw_point(pDev, x, y0);	// 依次画点
		}
	}
	else if (x0 == x1)	// 竖线单独处理
	{
		/* 0号点Y坐标大于1号点Y坐标，则交换两点Y坐标 */
		if (y0 > y1) {temp = y0; y0 = y1; y1 = temp;}
		
		/* 遍历Y坐标 */
		for (y = y0; y <= y1; y ++)
		{
			__oled_draw_point(pDev, x0, y);	// 依次画点
		}
	}
	else				// 斜线
	{
		/* 使用Bresenham算法画直线，可以避免耗时的浮点运算，效率更高 */
		/* 参考文档：https://www.cs.montana.edu/courses/spring2009/425/dslectures/Bresenham.pdf */
		/* 参考教程：https://www.bilibili.com/video/BV1364y1d7Lo */
		
		if (x0 > x1)	// 0号点X坐标大于1号点X坐标
		{
			/* 交换两点坐标 */
			/* 交换后不影响画线，但是画线方向由第一、二、三、四象限变为第一、四象限 */
			temp = x0; x0 = x1; x1 = temp;
			temp = y0; y0 = y1; y1 = temp;
		}
		
		if (y0 > y1)	// 0号点Y坐标大于1号点Y坐标
		{
			/* 将Y坐标取负 */
			/* 取负后影响画线，但是画线方向由第一、四象限变为第一象限 */
			y0 = -y0;
			y1 = -y1;
			
			/* 置标志位yflag，记住当前变换，在后续实际画线时，再将坐标换回来 */
			yflag = 1;
		}
		
		if (y1 - y0 > x1 - x0)	// 画线斜率大于1
		{
			/* 将X坐标与Y坐标互换 */
			/* 互换后影响画线，但是画线方向由第一象限0~90度范围变为第一象限0~45度范围 */
			temp = x0; x0 = y0; y0 = temp;
			temp = x1; x1 = y1; y1 = temp;
			
			/* 置标志位xyflag，记住当前变换，在后续实际画线时，再将坐标换回来 */
			xyflag = 1;
		}
		
		/* 以下为Bresenham算法画直线 */
		/* 算法要求，画线方向必须为第一象限0~45度范围 */
		dx = x1 - x0;
		dy = y1 - y0;
		incrE = 2 * dy;
		incrNE = 2 * (dy - dx);
		d = 2 * dy - dx;
		x = x0;
		y = y0;
		
		/* 画起始点，同时判断标志位，将坐标换回来 */
		if (yflag && xyflag){__oled_draw_point(pDev, y, -x);}
		else if (yflag)		{__oled_draw_point(pDev, x, -y);}
		else if (xyflag)	{__oled_draw_point(pDev, y, x);}
		else				{__oled_draw_point(pDev, x, y);}
		
		while (x < x1)		// 遍历X轴的每个点
		{
			x ++;
			if (d < 0)		// 下一个点在当前点东方
			{
				d += incrE;
			}
			else			// 下一个点在当前点东北方
			{
				y ++;
				d += incrNE;
			}
			
			/* 画每一个点，同时判断标志位，将坐标换回来 */
			if (yflag && xyflag){__oled_draw_point(pDev, y, -x);}
			else if (yflag)		{__oled_draw_point(pDev, x, -y);}
			else if (xyflag)	{__oled_draw_point(pDev, y, x);}
			else				{__oled_draw_point(pDev, x, y);}
		}	
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED矩形
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	x			:	指定矩形左上角的横坐标，范围：0~127
 * @param	y			:	指定矩形左上角的纵坐标，范围：0~63
 * @param	width		:	指定矩形的宽度，范围：0~128
 * @param	height		:	指定矩形的高度，范围：0~64
 * @param	isFilled	:	指定矩形是否填充
			范围		:	OLED_UNFILLED	不填充
							OLED_FILLED		填充
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_draw_rectangle(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t width, uint8_t height, uint8_t isFilled)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t i, j;
	if (!isFilled)		// 指定矩形不填充
	{
		/* 遍历上下x坐标，画矩形上下两条线 */
		for (i = x; i < x + width; i ++)
		{
			__oled_draw_point(pDev, i, y);
			__oled_draw_point(pDev, i, y + height - 1);
		}
		/* 遍历左右y坐标，画矩形左右两条线 */
		for (i = y; i < y + height; i ++)
		{
			__oled_draw_point(pDev, x, i);
			__oled_draw_point(pDev, x + width - 1, i);
		}
	}
	else				// 指定矩形填充
	{
		/* 遍历x坐标 */
		for (i = x; i < x + width; i ++)
		{
			/* 遍历y坐标 */
			for (j = y; j < y + height; j ++)
			{
				/* 在指定区域画点，填充满矩形 */
				__oled_draw_point(pDev, i, j);
			}
		}
	}
	
