903257958/stm32_oop_driver/ssd1306_spi_hw_dma/driver/oled.c
	return 0;
}

/******************************************************************************
 * @brief	OLED三角形
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	x0			:	指定第一个端点的横坐标，范围：0~127
 * @param	y0			:	指定第一个端点的纵坐标，范围：0~63
 * @param	x1			:	指定第二个端点的横坐标，范围：0~127
 * @param	y1			:	指定第二个端点的纵坐标，范围：0~63
 * @param	x2			:	指定第三个端点的横坐标，范围：0~127
 * @param	y2			:	指定第三个端点的纵坐标，范围：0~63
 * @param	isFilled	:	指定三角形是否填充
			范围		:	OLED_UNFILLED	不填充
							OLED_FILLED		填充
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_draw_triangle(OLEDDev_t *pDev, uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint8_t x2, uint8_t y2, uint8_t IsFilled)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t minx = x0, miny = y0, maxx = x0, maxy = y0;
	uint8_t i, j;
	int16_t vx[] = {x0, x1, x2};
	int16_t vy[] = {y0, y1, y2};
	
	if (!IsFilled)			// 指定三角形不填充
	{
		/* 调用画线函数，将三个点用直线连接 */
		__oled_draw_line(pDev, x0, y0, x1, y1);
		__oled_draw_line(pDev, x0, y0, x2, y2);
		__oled_draw_line(pDev, x1, y1, x2, y2);
	}
	else					// 指定三角形填充
	{
		/* 找到三个点最小的X、Y坐标 */
		if (x1 < minx) {minx = x1;}
		if (x2 < minx) {minx = x2;}
		if (y1 < miny) {miny = y1;}
		if (y2 < miny) {miny = y2;}
		
		/* 找到三个点最大的X、Y坐标 */
		if (x1 > maxx) {maxx = x1;}
		if (x2 > maxx) {maxx = x2;}
		if (y1 > maxy) {maxy = y1;}
		if (y2 > maxy) {maxy = y2;}
		
		/* 最小最大坐标之间的矩形为可能需要填充的区域 */
		/* 遍历此区域中所有的点 */
		/* 遍历X坐标 */		
		for (i = minx; i <= maxx; i ++)
		{
			/* 遍历Y坐标 */	
			for (j = miny; j <= maxy; j ++)
			{
				/* 调用OLED_pnpoly，判断指定点是否在指定三角形之中 */
				/* 如果在，则画点，如果不在，则不做处理 */
				if (OLED_pnpoly(3, vx, vy, i, j)) {__oled_draw_point(pDev, i, j);}
			}
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED画圆
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	x			:	指定圆的圆心横坐标，范围：0~127
 * @param	y			:	指定圆的圆心纵坐标，范围：0~63
 * @param	radius		:	指定圆的半径，范围：0~255
 * @param	isFilled	:	指定圆是否填充
			范围		:	OLED_UNFILLED	不填充
							OLED_FILLED		填充
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_draw_circle(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t radius, uint8_t IsFilled)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	int16_t x1, y1, d, j;
	
	/* 使用Bresenham算法画圆，可以避免耗时的浮点运算，效率更高 */
	/* 参考文档：https://www.cs.montana.edu/courses/spring2009/425/dslectures/Bresenham.pdf */
	/* 参考教程：https://www.bilibili.com/video/BV1VM4y1u7wJ */
	
	d = 1 - radius;
	x1 = 0;
	y1 = radius;
	
	/* 画每个八分之一圆弧的起始点 */
	__oled_draw_point(pDev, x + x1, y + y1);
	__oled_draw_point(pDev, x - x1, y - y1);
	__oled_draw_point(pDev, x + y1, y + x1);
	__oled_draw_point(pDev, x - y1, y - x1);
	
	if (IsFilled)		// 指定圆填充
	{
		/* 遍历起始点Y坐标 */
		for (j = -y1; j < y1; j ++)
		{
			/* 在指定区域画点，填充部分圆 */
			__oled_draw_point(pDev, x, y + j);
		}
	}
	
	while (x1 < y1)		// 遍历X轴的每个点
	{
		x1 ++;
		if (d < 0)		// 下一个点在当前点东方
		{
			d += 2 * x1 + 1;
		}
		else			// 下一个点在当前点东南方
		{
			y1 --;
			d += 2 * (x1 - y1) + 1;
		}
		
		/* 画每个八分之一圆弧的点 */
		__oled_draw_point(pDev, x + x1, y + y1);
		__oled_draw_point(pDev, x + y1, y + x1);
		__oled_draw_point(pDev, x - x1, y - y1);
		__oled_draw_point(pDev, x - y1, y - x1);
		__oled_draw_point(pDev, x + x1, y - y1);
		__oled_draw_point(pDev, x + y1, y - x1);
		__oled_draw_point(pDev, x - x1, y + y1);
		__oled_draw_point(pDev, x - y1, y + x1);
		
		if (IsFilled)	// 指定圆填充
		{
			/* 遍历中间部分 */
			for (j = -y1; j < y1; j ++)
			{
				/* 在指定区域画点，填充部分圆 */
				__oled_draw_point(pDev, x + x1, y + j);
				__oled_draw_point(pDev, x - x1, y + j);
			}
			
			/* 遍历两侧部分 */
			for (j = -x1; j < x1; j ++)
			{
				/* 在指定区域画点，填充部分圆 */
				__oled_draw_point(pDev, x - y1, y + j);
				__oled_draw_point(pDev, x + y1, y + j);
			}
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED画椭圆
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	x			:	指定椭圆的圆心横坐标，范围：0~127
 * @param	y			:	指定椭圆的圆心纵坐标，范围：0~63
 * @param	a			:	指定椭圆的横向半轴长度，范围：0~255
 * @param	b			:	指定椭圆的纵向半轴长度，范围：0~255
 * @param	isFilled	:	指定椭圆是否填充
			范围		:	OLED_UNFILLED	不填充
							OLED_FILLED		填充
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_draw_ellipse(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t a, uint8_t b, uint8_t isFilled)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	int16_t x1, y1, j;
	float d1, d2;
	
	/* 使用Bresenham算法画椭圆，可以避免部分耗时的浮点运算，效率更高 */
	/* 参考链接：https://blog.csdn.net/myf_666/article/details/128167392 */
	
	x1 = 0;
	y1 = b;
	d1 = b * b + a * a * (-b + 0.5);
	
	if (isFilled)	// 指定椭圆填充
	{
		/* 遍历起始点Y坐标 */
		for (j = -y1; j < y1; j ++)
		{
			/* 在指定区域画点，填充部分椭圆 */
			__oled_draw_point(pDev, x, y + j);
			__oled_draw_point(pDev, x, y + j);
		}
	}
	
	/* 画椭圆弧的起始点 */
	__oled_draw_point(pDev, x + x1, y + y1);
	__oled_draw_point(pDev, x - x1, y - y1);
	__oled_draw_point(pDev, x - x1, y + y1);
	__oled_draw_point(pDev, x + x1, y - y1);
	
	/* 画椭圆中间部分 */
	while (b * b * (x1 + 1) < a * a * (y1 - 0.5))
	{
		if (d1 <= 0)		// 下一个点在当前点东方
		{
			d1 += b * b * (2 * x1 + 3);
		}
		else				// 下一个点在当前点东南方
		{
			d1 += b * b * (2 * x1 + 3) + a * a * (-2 * y1 + 2);
			y1 --;
		}
		x1 ++;
		
		if (isFilled)	// 指定椭圆填充
		{
			/* 遍历中间部分 */
			for (j = -y1; j < y1; j ++)
			{
				/* 在指定区域画点，填充部分椭圆 */
				__oled_draw_point(pDev, x + x1, y + j);
				__oled_draw_point(pDev, x - x1, y + j);
			}
		}
		
		/* 画椭圆中间部分圆弧 */
		__oled_draw_point(pDev, x + x1, y + y1);
		__oled_draw_point(pDev, x - x1, y - y1);
		__oled_draw_point(pDev, x - x1, y + y1);
		__oled_draw_point(pDev, x + x1, y - y1);
	}                               
	
	/* 画椭圆两侧部分*/
	d2 = b * b * (x1 + 0.5) * (x1 + 0.5) + a * a * (y1 - 1) * (y1 - 1) - a * a * b * b;
	
	while (y1 > 0)
	{
		if (d2 <= 0)		// 下一个点在当前点东方
		{
			d2 += b * b * (2 * x1 + 2) + a * a * (-2 * y1 + 3);
			x1 ++;
			
		}
		else				// 下一个点在当前点东南方
		{
			d2 += a * a * (-2 * y1 + 3);
		}
		y1 --;
		
		if (isFilled)	// 指定椭圆填充
		{
			/* 遍历两侧部分 */
			for (j = -y1; j < y1; j ++)
			{
				/* 在指定区域画点，填充部分椭圆 */
				__oled_draw_point(pDev, x + x1, y + j);
				__oled_draw_point(pDev, x - x1, y + j);
			}
		}
		
		/* 画椭圆两侧部分圆弧 */
		__oled_draw_point(pDev, x + x1, y + y1);
		__oled_draw_point(pDev, x - x1, y - y1);
		__oled_draw_point(pDev, x - x1, y + y1);
		__oled_draw_point(pDev, x + x1, y - y1);
	}
	
