903257958/stm32_oop_driver/ssd1306_spi_hw_dma/driver/oled.c
	return 0;
}

/******************************************************************************
 * @brief	OLED画圆弧
 * @param	pDev		:	OLEDDev_t结构体指针
 * @param	x			:	指定圆弧的圆心横坐标，范围：0~127
 * @param	y			:	指定圆弧的圆心纵坐标，范围：0~63
 * @param	radius		:	指定圆弧的半径，范围：0~255
 * @param	startAngle	:	指定圆弧的起始角度，范围：-180~180
			水平向右为0度，水平向左为180度或-180度，下方为正数，上方为负数，顺时针旋转
 * @param	endAngle	:	指定圆弧的终止角度，范围：-180~180
			水平向右为0度，水平向左为180度或-180度，下方为正数，上方为负数，顺时针旋转
 * @param	isFilled	:	指定圆弧是否填充，填充后为扇形
			范围		:	OLED_UNFILLED	不填充
							OLED_FILLED		填充
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_draw_arc(OLEDDev_t *pDev, uint8_t x, uint8_t y, uint8_t radius, int16_t startAngle, int16_t endAngle, uint8_t isFilled)
{	
	if (!pDev || !pDev->initFlag)
		return -1;
	
	int16_t x1, y1, d, j;
	
	/* 此函数借用Bresenham算法画圆的方法 */
	
	d = 1 - radius;
	x1 = 0;
	y1 = radius;
	
	/* 在画圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理 */
	if (OLED_IsInAngle(x1, y1, startAngle, endAngle))	{__oled_draw_point(pDev, x + x1, y + y1);}
	if (OLED_IsInAngle(-x1, -y1, startAngle, endAngle)) {__oled_draw_point(pDev, x - x1, y - y1);}
	if (OLED_IsInAngle(y1, x1, startAngle, endAngle)) {__oled_draw_point(pDev, x + y1, y + x1);}
	if (OLED_IsInAngle(-y1, -x1, startAngle, endAngle)) {__oled_draw_point(pDev, x - y1, y - x1);}
	
	if (isFilled)	// 指定圆弧填充
	{
		/* 遍历起始点Y坐标 */
		for (j = -y1; j < y1; j ++)
		{
			/* 在填充圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理 */
			if (OLED_IsInAngle(0, j, startAngle, endAngle)) {__oled_draw_point(pDev, x, y + j);}
		}
	}
	
	while (x1 < y1)		// 遍历X轴的每个点
	{
		x1 ++;
		if (d < 0)		// 下一个点在当前点东方
		{
			d += 2 * x1 + 1;
		}
		else			// 下一个点在当前点东南方
		{
			y1 --;
			d += 2 * (x1 - y1) + 1;
		}
		
		/* 在画圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理 */
		if (OLED_IsInAngle(x1, y1, startAngle, endAngle)) {__oled_draw_point(pDev, x + x1, y + y1);}
		if (OLED_IsInAngle(y1, x1, startAngle, endAngle)) {__oled_draw_point(pDev, x + y1, y + x1);}
		if (OLED_IsInAngle(-x1, -y1, startAngle, endAngle)) {__oled_draw_point(pDev, x - x1, y - y1);}
		if (OLED_IsInAngle(-y1, -x1, startAngle, endAngle)) {__oled_draw_point(pDev, x - y1, y - x1);}
		if (OLED_IsInAngle(x1, -y1, startAngle, endAngle)) {__oled_draw_point(pDev, x + x1, y - y1);}
		if (OLED_IsInAngle(y1, -x1, startAngle, endAngle)) {__oled_draw_point(pDev, x + y1, y - x1);}
		if (OLED_IsInAngle(-x1, y1, startAngle, endAngle)) {__oled_draw_point(pDev, x - x1, y + y1);}
		if (OLED_IsInAngle(-y1, x1, startAngle, endAngle)) {__oled_draw_point(pDev, x - y1, y + x1);}
		
		if (isFilled)	// 指定圆弧填充
		{
			/* 遍历中间部分 */
			for (j = -y1; j < y1; j ++)
			{
				/* 在填充圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理 */
				if (OLED_IsInAngle(x1, j, startAngle, endAngle)) {__oled_draw_point(pDev, x + x1, y + j);}
				if (OLED_IsInAngle(-x1, j, startAngle, endAngle)) {__oled_draw_point(pDev, x - x1, y + j);}
			}
			
			/*遍历两侧部分*/
			for (j = -x1; j < x1; j ++)
			{
				/* 在填充圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理 */
				if (OLED_IsInAngle(-y1, j, startAngle, endAngle)) {__oled_draw_point(pDev, x - y1, y + j);}
				if (OLED_IsInAngle(y1, j, startAngle, endAngle)) {__oled_draw_point(pDev, x + y1, y + j);}
			}
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	去初始化OLED
 * @param	pDev   :  OLEDDev_t结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_deinit(OLEDDev_t *pDev)
{  
	if (!pDev || !pDev->initFlag)
		return -1;
	
	OLEDPrivData_t *pPrivData = (OLEDPrivData_t *)pDev->pPrivData;
	
	/* 关闭时钟 */
	__oled_config_gpio_clock_disable(pDev->info.RESPort);
	__oled_config_gpio_clock_disable(pDev->info.DCPort);
	__oled_config_dma_clock_disable(pDev->info.spix);
	
	/* 复位GPIO */
	__oled_gpio_deinit(pDev->info.RESPort);
	__oled_gpio_deinit(pDev->info.DCPort);
	
	/* 去初始化硬件SPI */
	pPrivData->oled.deinit(&pPrivData->oled);
	
	/* 释放私有数据内存 */
	free(pDev->pPrivData);
	pDev->pPrivData = NULL;
	
	pDev->initFlag = false;	// 修改初始化标志
	return 0;
}

/**********************************************************************功能函数*/
